<?php

// через директиву ми здійснюємо виконання файлу що здійснює підключення до БД

require_once "includes/connection.php";
// дириктива що підключає осноні функції процесу
require_once "functions.php";
//  коли запускається скрипт перевіряється чи має запит кукіси скрипта
// якщо немає то при відпрацюванні скрипта результат його виконання повертається розом із кукісом
// що містить унікальний ідентифікатор сесії,
//ідентифікатор ротрібний для ідентифікаці відповідного масиву із данними сесії на сервері
// наступний раз коли клієнт робить запит він відправляє його із кукісом що має цей ідентифікатор на сервер
// після чого сервер знає який масив сесії використовувати
// таким чином через цю функцію ми отримуємо дані в масиві $_SESSION, або відправляємо кукіси клієнту
session_start();

// функція повертає назву вигляду сторінки залежно від того яка сторінка була визвана в матоді за методом get
$_page = pageToOpen();
// функція для збереження інформації сесії про корзину у випаку відсутності відповідного id товару в бд повернає false
$message = initEditSession($link);
// змінюється кількість елементів корзини
changeCart();
// підключається представлення сторінки може бути обо вибір товару, або корзина
require_once "view/master.php";
//після виконання скрипта розриваємо підключення із бд
mysqli_close($link);
