<?php
$words = explode(' ', 'My sentence is not very complicated');
//  приклад демонструє розділення рядка символом або рядком який міститься між усіма гаданими рядками

$words = preg_split('/\d\. /', 'my day: 1. get up 2. get dressed 3. eat toast');
$lines = preg_split('/[\n\r]+/', $_POST['textarea']);

// перший приклад ділить рядок за одною цифрою і крапкою
// другий - за знаходженням в рядку символу переносу або каретки які крім того можуть повторюватися декілька разів підряд

$words = preg_split('/ x /i', '31 inches x 22 inches X 9 inches');
// ділить по символу x без урахування регістру

$math = "3 + 2 / 7 - 9";
$stack = preg_split('/ *([+\-\/*]) */', $math, -1, PREG_SPLIT_DELIM_CAPTURE);
print_r($stack);
// функція по пегулярному виразу ділить рядок по математичним символам +,-,*,/ що є між пробілами
// пошук може приймати декілька символів підряд наприклад "2 ++++++ 2" - буде сприйнято і розділено
// повертається масив рядків-символів із символами що знаходяться в класі за рахунок PREG_SPLIT_DELIM_CAPTURE
// -1 ігторує останнє розділення