<?php
$car = new car; // створення об'єкта класу, викликається констуктор
// ...
unset($car); // знищення об'єкту , викликається деструктор
class car
{
    function __destruct()
    {
        // ...
    }
}
// визначення деструктора в класі
class Database
{
    function __destruct()
    {
        db_close($this->handle); // Закрытие подключения к базе данных
    }
}
// наприклад в конструкторі можна проводити підключення до бази даних, а в деструткорі закривати це підключення
